<script setup lang="ts">

</script>

<template>

  <div class="bg-elevated">
    <UContainer>
      <div class="flex items-center gap-30 py-20">

        <div class="w-2/3">
          <h2 class="pb-4 font-medium font-serif text-muted">
            О питомнике
          </h2>

          <div class="grid grid-cols-2 gap-30 leading-relaxed">
            <div class="max-w-prose">
              Каждый щенок, который рождается здесь, – это маленькое чудо, в которое я вкладываю всю
              свою любовь и заботу.
              С первых дней жизни я наблюдаю за ними, помогаю им расти и развиваться, окружаю их
              теплом и лаской.
              Я знаю все их маленькие привычки, понимаю их взгляды, чувствую их настроение.
            </div>

            <div>
              Для меня важно не просто вырастить здоровых и красивых собак, но и воспитать в них
              добрый и ласковый характер.
              Я стараюсь, чтобы каждый щенок вырос уверенным в себе, общительным и преданным другом
              для своей будущей семьи.
            </div>
          </div>
        </div>

        <img
            src="/0S9Sg1mb-iU.jpg"
            alt="BelovedBully питомник"
            class="w-1/3 h-150 object-cover"
        />
      </div>
    </UContainer>
  </div>

  <UContainer>
    <div class="text-xl py-10">
      BelovedBully — питомник, где рождаются и растут лучшие представители породы американский булли.
      Мы создаем заботливую и профессиональную среду для наших питомцев,
      уделяя внимание их здоровью, социализации и развитию.
    </div>
  </UContainer>

  <div class="bg-elevated">
    <UContainer>
      <div class="flex items-center gap-30 py-20">
        <img
            src="/HbjyGRj8i18.jpg"
            alt="BelovedBully питомник"
            class="w-1/3 h-150 object-cover"
        />
        <div class="w-2/3">
          <h2 class="pb-4 font-medium font-serif text-muted">
            Наша история
          </h2>

          <div class="grid grid-cols-2 gap-30 leading-relaxed">
            <div class="max-w-prose">
              Наш путь начался с большой любви к собакам и стремления создать идеального компаньона.
								Изучая особенности породы, мы объединили знания, опыт и страсть,
								чтобы вырастить собак, которые будут не только красивыми, но и здоровыми, умными и
								дружелюбными.

								Каждый наш щенок рождается и воспитывается в атмосфере заботы и любви.

            </div>

            <div>
              Мы тщательно подбираем пары для вязок, следим за здоровьем наших питомцев
								и уделяем особое внимание их социализации.

								Сегодня наш питомник — это не просто место, где выращивают американских булли,
								а настоящая семья, объединенная любовью к этим удивительным собакам.

								Мы гордимся тем, что наши собаки приносят радость и преданность своим владельцам,
								становясь неотъемлемой частью их жизни.
            </div>
          </div>
        </div>


      </div>
    </UContainer>
  </div>

</template>

<style scoped>

</style>